# Core
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "starship"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "tree"

# Shell
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Languages
brew "go"
brew "nvm"

# Python
brew "uv"

# Containers
brew "docker"
brew "docker-compose"

# Casks
cask "karabiner-elements"
cask "iterm2"
